Revit 2027 API
ParameterFilterRuleFactory.CreateIsAssociatedWithGlobalParameterRule Method
 Creates a filter rule that determines whether a parameter is associated with a certain global parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FilterRule CreateIsAssociatedWithGlobalParameterRule(
	ElementId parameter,
	ElementId value
)
Public Shared Function CreateIsAssociatedWithGlobalParameterRule (
	parameter As ElementId,
	value As ElementId
) As FilterRule
public:
static FilterRule^ CreateIsAssociatedWithGlobalParameterRule(
	ElementId^ parameter,
	ElementId^ value
)
static member CreateIsAssociatedWithGlobalParameterRule :
        parameter : ElementId *
        value : ElementId -> FilterRule
Parameters
parameter ElementId
 A parameter that can be associated with an existing global parameter of a compatible type.
value ElementId
 The global parameter used to test the association.
Return Value
FilterRule
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ParameterFilterRuleFactory Class
Autodesk.Revit.DB Namespace